### Terragrunt Plan :memo:

```text
time=2024-08-06T16:09:14Z level=info msg=The stack at terraform will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/homelab/homelab/terraform/aliyun


Acquiring state lock. This may take a few moments...
module.nixos_sin0.data.external.build: Reading...
module.nixos_hgh1.data.external.build: Reading...
module.nixos_hgh0.data.external.build: Reading...
module.nixos_hgh2.data.external.build: Reading...
module.nixos_sin0.data.external.keyscan: Reading...
module.nixos_sin0.data.external.keyscan: Read complete after 2s [id=-]
module.nixos_sin0.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh1.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh0.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh2.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh2.data.external.keyscan: Reading...
module.nixos_hgh1.data.external.keyscan: Reading...
module.nixos_hgh0.data.external.keyscan: Reading...
module.nixos_hgh1.data.external.keyscan: Read complete after 3s [id=-]
module.nixos_hgh2.data.external.keyscan: Read complete after 3s [id=-]
module.nixos_hgh0.data.external.keyscan: Read complete after 2s [id=-]
module.nixos_hgh2.data.external.build: Read complete after 20s [id=-]
module.nixos_sin0.data.external.build: Still reading... [20s elapsed]
module.nixos_hgh1.data.external.build: Still reading... [20s elapsed]
module.nixos_hgh0.data.external.build: Still reading... [20s elapsed]
module.nixos_hgh1.data.external.build: Read complete after 20s [id=-]
module.nixos_sin0.data.external.build: Read complete after 20s [id=-]
module.nixos_hgh0.data.external.build: Read complete after 20s [id=-]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # alicloud_vpc_ipv4_gateway.hgh has been deleted
  - resource "alicloud_vpc_ipv4_gateway" "hgh" {
      - id                = "ipv4gw-bp1h0x8hju0hrpnfxhc08" -> null
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # alicloud_route_entry.hgh will be created
  + resource "alicloud_route_entry" "hgh" {
      + destination_cidrblock = "0.0.0.0/0"
      + id                    = (known after apply)
      + nexthop_id            = (known after apply)
      + nexthop_type          = "Ipv4Gateway"
      + route_table_id        = "vtb-bp1bflyq5absoxddf04jj"
      + router_id             = (known after apply)
    }

  # alicloud_vpc_ipv4_gateway.hgh will be created
  + resource "alicloud_vpc_ipv4_gateway" "hgh" {
      + create_time                 = (known after apply)
      + enabled                     = (known after apply)
      + id                          = (known after apply)
      + ipv4_gateway_id             = (known after apply)
      + ipv4_gateway_route_table_id = (known after apply)
      + resource_group_id           = (known after apply)
      + status                      = (known after apply)
      + vpc_id                      = "vpc-bp1uxe2x9piyejy6r5x4s"
    }

  # module.nixos_hgh0.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "8700195295887253268" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/22ygg47yq88j098yb22xdy4h2ycbzhin-nixos-system-hgh0-24.11.20240802.d049530" -> "/nix/store/j0fa2m4gzp20670d1ilzc3a0g7535688-nixos-system-hgh0-24.11.20240804.cb9a96f"
            # (1 unchanged element hidden)
        }
    }

  # module.nixos_hgh1.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "8200611008176968442" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/615d1f7fn8ci8ya9prcbspjh6y8wrr2s-nixos-system-hgh1-24.11.20240802.d049530" -> "/nix/store/ciczbwbij7dyiha30134sa14lkmzhsqm-nixos-system-hgh1-24.11.20240804.cb9a96f"
            # (1 unchanged element hidden)
        }
    }

  # module.nixos_hgh2.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "761073371928912531" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/mb1l7l3dlpz2xdfhc290jlrmlx94d2hz-nixos-system-hgh2-24.11.20240802.d049530" -> "/nix/store/sv4iqxxhidwg15plwks6aa1ly55mv8bi-nixos-system-hgh2-24.11.20240804.cb9a96f"
            # (1 unchanged element hidden)
        }
    }

  # module.nixos_sin0.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "1279142155839225321" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/hpc68ddmaa4hv4laja8prx6n724fr0q0-nixos-system-sin0-24.11.20240802.d049530" -> "/nix/store/rwa209ivh95jmq04y5iz4a4hdhbblbx4-nixos-system-sin0-24.11.20240804.cb9a96f"
            # (1 unchanged element hidden)
        }
    }

Plan: 6 to add, 0 to change, 4 to destroy.
```

**Status**: out of sync :warning: